gdgly/stm32L151_nbiot_tmote_app_workspace/hc32L196_nbiot_tmote_app_boot/Hardware/QMC5883L/hal_qmc5883l.c
/**
  *********************************************************************************************************
  * @file    hal_qmc5883l.c
  * @author  Movebroad -- KK
  * @version V1.0
  * @date    2020-03-12
  * @brief   
  *********************************************************************************************************
  * @attention
  *
  *
  *
  *********************************************************************************************************
  */

#include "hc32l19x_config.h"
#include "platform_config.h"
#include "platform_map.h"
#include "hal_qmc5883l.h"
#include "delay.h"
#include "usart.h"

/**********************************************************************************************************
 @Function			static u8 QMC5883L_WriteByte(u8 ucRegAddr, u8 ucRegData)
 @Description			QMC5883L写入1Byte数据到寄存器( 内部调用 )
 @Input				ucRegAddr									: 写入地址
					ucRegData									: 写入数据
 @Return				0
					Err
**********************************************************************************************************/
static u8 QMC5883L_WriteByte(u8 ucRegAddr, u8 ucRegData)
{
	timeMeterTypeDef Qmctimer;
	
	HC32_TimeMeter_CountdownMS(&Qmctimer, 1000);
	
	/* Send Start Signal */
	I2C_SetFunc(QMC_I2C_TYPE, I2cStart_En);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x08 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	I2C_ClearFunc(QMC_I2C_TYPE, I2cStart_En);
	
	/* Send I2C Slave Addr Write */
	I2C_WriteByte(QMC_I2C_TYPE, QMC5883L_SLAVE_ADDRESS_W);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x18 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	
	/* Send Register Addr */
	I2C_WriteByte(QMC_I2C_TYPE, ucRegAddr);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x28 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	
	/* Send Register Data */
	I2C_WriteByte(QMC_I2C_TYPE, ucRegData);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x28 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	
	/* Send Stop Signal */
	I2C_SetFunc(QMC_I2C_TYPE, I2cStop_En);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	I2C_ClearFunc(QMC_I2C_TYPE, I2cStop_En);
	
	return 0;
}

/**********************************************************************************************************
 @Function			static u8 QMC5883L_ReadByte(u8 ucRegAddr)
 @Description			QMC5883L读取1Byte数据( 内部调用 )
 @Input				ucRegAddr									: 读取数据地址
 @Return				ucRegAddr									: 读取数据
**********************************************************************************************************/
static u8 QMC5883L_ReadByte(u8 ucRegAddr)
{
	u8 ucData;
	
	timeMeterTypeDef Qmctimer;
	
	HC32_TimeMeter_CountdownMS(&Qmctimer, 1000);
	
	/* Send Start Signal */
	I2C_SetFunc(QMC_I2C_TYPE, I2cStart_En);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x08 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	I2C_ClearFunc(QMC_I2C_TYPE, I2cStart_En);
	
	/* Send I2C Slave Addr Write */
	I2C_WriteByte(QMC_I2C_TYPE, QMC5883L_SLAVE_ADDRESS_W);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x18 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	
	/* Send Register Addr */
	I2C_WriteByte(QMC_I2C_TYPE, ucRegAddr);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x28 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	
	/* Send Start Signal */
	I2C_SetFunc(QMC_I2C_TYPE, I2cStart_En);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x10 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	I2C_ClearFunc(QMC_I2C_TYPE, I2cStart_En);
	
	/* Send I2C Slave Addr Read */
	I2C_WriteByte(QMC_I2C_TYPE, QMC5883L_SLAVE_ADDRESS_R);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x40 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	
	/* Read Data */
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	if (0x58 != I2C_GetState(QMC_I2C_TYPE)) {
		return Error;
	}
	ucData = I2C_ReadByte(QMC_I2C_TYPE);
	
	/* Send Stop Signal */
	I2C_SetFunc(QMC_I2C_TYPE, I2cStop_En);
	I2C_ClearIrq(QMC_I2C_TYPE);
	while (0 == I2C_GetIrq(QMC_I2C_TYPE)) {
		if (HC32_TimeMeter_IsExpiredMS(&Qmctimer) != false) {
			return ErrorTimeout;
		}
	}
	I2C_ClearFunc(QMC_I2C_TYPE, I2cStop_En);
	
	return ucData;
}

/**********************************************************************************************************
 @Function			void QMC5883L_Drdy_Init(void)
 @Description			QMC5883L引脚配置PA11高电平读取
 @Input				void
 @Return				void
**********************************************************************************************************/
void QMC5883L_Drdy_Init(void)
{
	stc_gpio_cfg_t GPIO_Initure;
	
	DDL_ZERO_STRUCT(GPIO_Initure);
	
	GPIO_Initure.enDir			= GpioDirIn;
	GPIO_Initure.enDrv			= GpioDrvH;
	GPIO_Initure.enPu			= GpioPuDisable;
	GPIO_Initure.enPd			= GpioPdEnable;
	GPIO_Initure.enOD			= GpioOdDisable;
	GPIO_Initure.enCtrlMode		= GpioFastIO;
	Gpio_Init(QMC_DRDY_GPIOx, QMC_DRDY_PIN, &GPIO_Initure);
}

/**********************************************************************************************************
 @Function			void QMC5883L_Drdy_DeInit(void)
 @Description			QMC5883L引脚配置PA11反初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void QMC5883L_Drdy_DeInit(void)
{
	stc_gpio_cfg_t GPIO_Initure;
	
	DDL_ZERO_STRUCT(GPIO_Initure);
	
	GPIO_Initure.enDir			= GpioDirIn;
	GPIO_Initure.enDrv			= GpioDrvH;
	GPIO_Initure.enPu			= GpioPuDisable;
	GPIO_Initure.enPd			= GpioPdDisable;
	GPIO_Initure.enOD			= GpioOdDisable;
	GPIO_Initure.enCtrlMode		= GpioFastIO;
	Gpio_Init(QMC_DRDY_GPIOx, QMC_DRDY_PIN, &GPIO_Initure);
}

/**********************************************************************************************************
 @Function			void QMC5883L_Discharge(void)
 @Description			QMC5883L复位
 @Input				void
 @Return				void
**********************************************************************************************************/
void QMC5883L_Discharge(void)
{
#if QMC_I2C_INTERFACE == QMC_I2C_INTERFACE0
	stc_gpio_cfg_t GPIO_Initure;
	
	DDL_ZERO_STRUCT(GPIO_Initure);
	
	GPIO_Initure.enDir			= GpioDirOut;
	GPIO_Initure.enDrv			= GpioDrvH;
	GPIO_Initure.enPu			= GpioPuDisable;
	GPIO_Initure.enPd			= GpioPdDisable;
	GPIO_Initure.enOD			= GpioOdDisable;
	
	Gpio_Init(I2C0_SCL_GPIOx, I2C0_SCL_PIN, &GPIO_Initure);
	Gpio_Init(I2C0_SDA_GPIOx, I2C0_SDA_PIN, &GPIO_Initure);
	
	Gpio_SetAfMode(I2C0_SCL_GPIOx, I2C0_SCL_PIN, GpioAf0);
	Gpio_SetAfMode(I2C0_SDA_GPIOx, I2C0_SDA_PIN, GpioAf0);
	
	Gpio_ClrIO(I2C0_SCL_GPIOx, I2C0_SCL_PIN);
	Gpio_ClrIO(I2C0_SDA_GPIOx, I2C0_SDA_PIN);
	Delay_MS(3000);
	Gpio_SetIO(I2C0_SCL_GPIOx, I2C0_SCL_PIN);
	Gpio_SetIO(I2C0_SDA_GPIOx, I2C0_SDA_PIN);
#endif
	
#if QMC_I2C_INTERFACE == QMC_I2C_INTERFACE1
	stc_gpio_cfg_t GPIO_Initure;
	
	DDL_ZERO_STRUCT(GPIO_Initure);
	
	GPIO_Initure.enDir			= GpioDirOut;
	GPIO_Initure.enDrv			= GpioDrvH;
	GPIO_Initure.enPu			= GpioPuDisable;
	GPIO_Initure.enPd			= GpioPdDisable;
	GPIO_Initure.enOD			= GpioOdDisable;
	
	Gpio_Init(I2C1_SCL_GPIOx, I2C1_SCL_PIN, &GPIO_Initure);
	Gpio_Init(I2C1_SDA_GPIOx, I2C1_SDA_PIN, &GPIO_Initure);
	
	Gpio_SetAfMode(I2C1_SCL_GPIOx, I2C1_SCL_PIN, GpioAf0);
	Gpio_SetAfMode(I2C1_SDA_GPIOx, I2C1_SDA_PIN, GpioAf0);
	
	Gpio_ClrIO(I2C1_SCL_GPIOx, I2C1_SCL_PIN);
	Gpio_ClrIO(I2C1_SDA_GPIOx, I2C1_SDA_PIN);
	Delay_MS(3000);
	Gpio_SetIO(I2C1_SCL_GPIOx, I2C1_SCL_PIN);
	Gpio_SetIO(I2C1_SDA_GPIOx, I2C1_SDA_PIN);
#endif
}

/**********************************************************************************************************
 @Function			void QMC5883L_Init(void)
 @Description			QMC5883L初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void QMC5883L_Init(void)
{
#if QMC_I2C_INTERFACE == QMC_I2C_INTERFACE0
	HC32_I2C0_Init(100000);
#endif
#if QMC_I2C_INTERFACE == QMC_I2C_INTERFACE1
	HC32_I2C1_Init(100000);
#endif
	
	QMC5883L_WriteByte(QMC5883L_CR2, QMC_SOFT_REST);
	
	QMC5883L_WriteByte(0x0B, 0x01);
	QMC5883L_WriteByte(0x20, 0x40);
	QMC5883L_WriteByte(0x21, 0x01);
	
	/* 64滤波, 8高斯范围, 200Hz输出, 初始化为StandBy */
	QMC5883L_WriteByte(QMC5883L_CR1, QMC_OSR_64 | QMC_RANGE_8G | QMC_RATES_200HZ | QMC_MODE_STANDBY);
	/* 引脚中断使能, 数据读取完指针自动偏转失能 */
	QMC5883L_WriteByte(QMC5883L_CR2, QMC_INT_ENABLE | QMC_POINT_ROLL_DISABLE);
	
	QMC5883L_Drdy_Init();
}




















































/**********************************************************************************************************
 @Function			void QMC5883L_ClearInsideData(void)
 @Description			QMC5883L清除内部待读取数据缓存
 @Input				void
 @Return				void
**********************************************************************************************************/
void QMC5883L_ClearInsideData(void)
{
	u8 index = 0;
	
	if (QMC_DRDY_READ() == 1) {
		for (index = 0; index < QMC_REG_MAG; index++) {
			QMC5883L_ReadByte(QMC_DATA_OUT_X_L + index);
		}
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Mode_Selection(u8 mode)
 @Description			QMC5883L工作模式选择
 @Input				mode : QMC_MODE_STANDBY/QMC_MODE_CONTINOUS
 @Return				void
**********************************************************************************************************/
void QMC5883L_Mode_Selection(u8 mode)
{
	u8 reg = 0;
	
	reg = QMC5883L_ReadByte(QMC5883L_CR1);
	if (mode == QMC_MODE_STANDBY) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xFC) | QMC_MODE_STANDBY);
	}
	else if (mode == QMC_MODE_CONTINOUS) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xFC) | QMC_MODE_CONTINOUS);
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Rates_Selection(u8 rates)
 @Description			QMC5883L数据输出速率选择
 @Input				rates : QMC_RATES_10HZ/QMC_RATES_50HZ/QMC_RATES_100HZ/QMC_RATES_200HZ
 @Return				void
**********************************************************************************************************/
void QMC5883L_Rates_Selection(u8 rates)
{
	u8 reg = 0;
	
	reg = QMC5883L_ReadByte(QMC5883L_CR1);
	if (rates == QMC_RATES_10HZ) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xF3) | QMC_RATES_10HZ);
	}
	else if (rates == QMC_RATES_50HZ) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xF3) | QMC_RATES_50HZ);
	}
	else if (rates == QMC_RATES_100HZ) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xF3) | QMC_RATES_100HZ);
	}
	else if (rates == QMC_RATES_200HZ) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xF3) | QMC_RATES_200HZ);
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Rates_Selection_Freq(u8 Freq)
 @Description			QMC5883L数据输出速率选择
 @Input				0, 1, 2, 3 : QMC_RATES_10HZ/QMC_RATES_50HZ/QMC_RATES_100HZ/QMC_RATES_200HZ
 @Return				void
**********************************************************************************************************/
void QMC5883L_Rates_Selection_Freq(u8 Freq)
{
	if (Freq == 0) {
		QMC5883L_Rates_Selection(QMC_RATES_10HZ);
	}
	else if (Freq == 1) {
		QMC5883L_Rates_Selection(QMC_RATES_50HZ);
	}
	else if (Freq == 2) {
		QMC5883L_Rates_Selection(QMC_RATES_100HZ);
	}
	else if (Freq == 3) {
		QMC5883L_Rates_Selection(QMC_RATES_200HZ);
	}
	else {
		QMC5883L_Rates_Selection(QMC_RATES_50HZ);
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Range_Selection(u8 range)
 @Description			QMC5883L测量范围选择
 @Input				range : QMC_RANGE_2G/QMC_RANGE_8G
 @Return				void
**********************************************************************************************************/
void QMC5883L_Range_Selection(u8 range)
{
	u8 reg = 0;
	
	reg = QMC5883L_ReadByte(QMC5883L_CR1);
	if (range == QMC_RANGE_2G) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xCF) | QMC_RANGE_2G);
	}
	else if (range == QMC_RANGE_8G) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0xCF) | QMC_RANGE_8G);
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Osr_Selection(u8 osr)
 @Description			QMC5883L内置滤波器带宽选择
 @Input				osr : QMC_OSR_512/QMC_OSR_256/QMC_OSR_128/QMC_OSR_64
 @Return				void
**********************************************************************************************************/
void QMC5883L_Osr_Selection(u8 osr)
{
	u8 reg = 0;
	
	reg = QMC5883L_ReadByte(QMC5883L_CR1);
	if (osr == QMC_OSR_512) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0x3F) | QMC_OSR_512);
	}
	else if (osr == QMC_OSR_256) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0x3F) | QMC_OSR_256);
	}
	else if (osr == QMC_OSR_128) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0x3F) | QMC_OSR_128);
	}
	else if (osr == QMC_OSR_64) {
		QMC5883L_WriteByte(QMC5883L_CR1, (reg & 0x3F) | QMC_OSR_64);
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Interrupt_Selection(u8 interrupt)
 @Description			QMC5883L引脚中断选择
 @Input				interrupt : QMC_INT_ENABLE/QMC_INT_DISABLE
 @Return				void
**********************************************************************************************************/
void QMC5883L_Interrupt_Selection(u8 interrupt)
{
	u8 reg = 0;
	
	reg = QMC5883L_ReadByte(QMC5883L_CR2);
	if (interrupt == QMC_INT_ENABLE) {
		QMC5883L_WriteByte(QMC5883L_CR2, (reg & 0xFE) | QMC_INT_ENABLE);
	}
	else if (interrupt == QMC_INT_DISABLE) {
		QMC5883L_WriteByte(QMC5883L_CR2, (reg & 0xFE) | QMC_INT_DISABLE);
	}
}

/**********************************************************************************************************
 @Function			void QMC5883L_Softwart_Reset(void)
 @Description			QMC5883L复位
 @Input				void
 @Return				void
**********************************************************************************************************/
void QMC5883L_Softwart_Reset(void)
{
	QMC5883L_WriteByte(QMC5883L_CR2, QMC_SOFT_REST);
	
	QMC5883L_WriteByte(0x0B, 0x01);
	QMC5883L_WriteByte(0x20, 0x40);
	QMC5883L_WriteByte(0x21, 0x01);
	
	/* 64滤波, 8高斯范围, 10Hz输出, 初始化为StandBy */
	QMC5883L_WriteByte(QMC5883L_CR1, QMC_OSR_64 | QMC_RANGE_8G | QMC_RATES_10HZ | QMC_MODE_STANDBY);
	/* 引脚中断使能, 数据读取完指针自动偏转失能 */
	QMC5883L_WriteByte(QMC5883L_CR2, QMC_INT_ENABLE | QMC_POINT_ROLL_DISABLE);
}



































/********************************************** END OF FLEE **********************************************/
